### production environment
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=ffab38df-cddf-433f-859a-6cfa161a5ceb-6380c778-7078-4cf9-86bd-5a6371b1c2c9-40a08517-ff80-4b40-b4e2-7c167a17825d]
data.azurerm_container_registry.main: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MzgwYzc3OC03MDc4LTRjZjktODZiZC01YTYzNzFiMWMyYzk7b2JqZWN0SWQ9NDBhMDg1MTctZmY4MC00YjQwLWI0ZTItN2MxNjdhMTc4MjVkO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azapi_resource.sql_database will be created
  + resource "azapi_resource" "sql_database" {
      + body                      = {
          + properties = {
              + autoPauseDelay                   = 15
              + availabilityZone                 = "NoPreference"
              + freeLimitExhaustionBehavior      = "BillOverUsage"
              + isLedgerOn                       = false
              + maxSizeBytes                     = 34359738368
              + minCapacity                      = 0.5
              + readScale                        = "Disabled"
              + requestedBackupStorageRedundancy = "Local"
              + useFreeLimit                     = true
              + zoneRedundant                    = false
            }
          + sku        = {
              + capacity = 1
              + family   = "Gen5"
              + name     = "GP_S_Gen5"
              + tier     = "GeneralPurpose"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "westeurope"
      + name                      = "sqldb-tshort"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Sql/servers/databases@2024-05-01-preview"
    }

  # azuread_group.sql_server_admins will be created
  + resource "azuread_group" "sql_server_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "SQL Server Admins for Server sql-tshort-prod-westeurope-001"
      + display_name                   = "SQL-Admins-sql-tshort-prod-westeurope-001"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "40a08517-ff80-4b40-b4e2-7c167a17825d",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westeurope"
      + name                                = "appi-tshort-prod-westeurope-001"
      + resource_group_name                 = "rg-tshort-prod-westeurope-001"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workspace_id                        = (known after apply)
    }

  # azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "cae-tshort-prod-westeurope-001"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + public_network_access            = (known after apply)
      + resource_group_name              = "rg-tshort-prod-westeurope-001"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + zone_redundancy_enabled          = false

      + workload_profile {
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westeurope"
      + name                            = "log-tshort-prod-westeurope-001"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-tshort-prod-westeurope-001"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_mssql_firewall_rule.main will be created
  + resource "azurerm_mssql_firewall_rule" "main" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = (known after apply)
      + administrator_login_password_wo          = (write-only attribute)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "westeurope"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sql-tshort-prod-westeurope-001"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-tshort-prod-westeurope-001"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + version                                  = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = true
          + login_username              = "SQL-Admins-sql-tshort-prod-westeurope-001"
          + object_id                   = (known after apply)
          + tenant_id                   = (known after apply)
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-tshort-prod-westeurope-001"
      + tags     = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app.main will be created
  + resource "azurerm_static_web_app" "main" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-tshort-prod-001"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-tshort-prod-westeurope-001"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app_custom_domain.primary will be created
  + resource "azurerm_static_web_app_custom_domain" "primary" {
      + domain_name       = "admin.tshort.me"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

  # azurerm_user_assigned_identity.api will be created
  + resource "azurerm_user_assigned_identity" "api" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "id-tshort-prod-westeurope-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-tshort-prod-westeurope-001"
      + tags                = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + tenant_id           = (known after apply)
    }

  # cloudflare_dns_record.primary will be created
  + resource "cloudflare_dns_record" "primary" {
      + comment             = "Primary domain for TShort prod Azure Static Web App"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "admin"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # time_sleep.group_provisioning will be created
  + resource "time_sleep" "group_provisioning" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "display_name" = "SQL-Admins-sql-tshort-prod-westeurope-001"
          + "object_id"    = (known after apply)
        }
    }

  # time_sleep.wait_for_dns_record will be created
  + resource "time_sleep" "wait_for_dns_record" {
      + create_duration = "2m"
      + id              = (known after apply)
      + triggers        = {
          + "record" = "admin.tshort.me"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ connection_string   = "Server=tcp:sql-tshort-prod-westeurope-001.database.windows.net,1433;Database=sqldb-tshort;Authentication=Active Directory Default;User ID=ea4ee532-8549-4e98-b76a-718249e82103;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;" -> (known after apply)
  ~ deployment_token    = (sensitive value)
  ~ sql_server_fqdn     = "sql-tshort-prod-westeurope-001.database.windows.net" -> (known after apply)
Releasing state lock. This may take a few moments...

```

</details>